In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":["Andy","Doe","John","Doe","Doe","Andy"],
    "marks":[23,45,67,89,90,23],
    "city":["delhi","mumbai","pune","delhi","mumbai","delhi"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

   name  marks    city
0  Andy     23   delhi
1   Doe     45  mumbai
2  John     67    pune
3   Doe     89   delhi
4   Doe     90  mumbai
5  Andy     23   delhi

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends.csv' , index=False)

In [7]:
df.tail(2)

   name  marks    city
4   Doe     90  mumbai
5  Andy     23   delhi

In [8]:
df.head(2)

   name  marks    city
0  Andy     23   delhi
1   Doe     45  mumbai

In [9]:
df.describe()

           marks
count   6.000000
mean   56.166667
std    30.544503
min    23.000000
25%    28.500000
50%    56.000000
75%    83.500000
max    90.000000